_posts/2015-10-03-A-framework-for-automated-feedback-with-Python-and-org-mode.html
---
title: A framework for automated feedback with Python and org-mode
date: 2015/10/03 20:23:29
updated: 2015/10/03 20:29:00
categories: emacs,python
tags: 
---



<p>
<a href="http://docs.autolab.cs.cmu.edu">Autolab</a> is an autograding service that automatically grades code assignments. It uses a program to evaluate a program on a secure virtual system. Using this requires you to run a server, and run code from students. I have never liked that because it is hard to sandbox code well enough to prevent malicious code from doing bad things. Autolab does it well, but it is a heavy solution. Here we explore a local version, one that is used to test for correctness, and not for grading. Here, if you are malicious, you reap what you sow&#x2026;
</p>

<p>
The basic idea I am working towards is that Emacs will provide content to be learned (through org-mode) with active exercises. The exercises will involve a code block, and the user will run a command on their code (or an advised C-c C-c) that checks the solution for correctness. A user will be able to see the solution, and maybe get hints.
</p>

<p>
Suppose we have a problem to solve \(e^x = 3\). This is a simple problem to solve, and here is a solution.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">from</span> scipy.optimize <span style="color: #0000FF;">import</span> fsolve
<span style="color: #0000FF;">import</span> numpy <span style="color: #0000FF;">as</span> np

<span style="color: #0000FF;">def</span> <span style="color: #006699;">objective</span>(x):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> np.exp(x) - 3

<span style="color: #0000FF;">def</span> <span style="color: #006699;">solve</span>():
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> fsolve(objective, 3)

<span style="color: #0000FF;">print</span> solve()
</pre>
</div>

<pre class="example">
[ 1.09861229]
</pre>

<p>
We would like to test this for correctness. We code this in a function-based form because we will later use the function <code>solve</code> to test for correctness. Let's see how we could test it with a test function. We will use exec on a string representing our code to get it into our namespace. I don't see a security issue here. You are writing the code! Eventually, we will be passing code to the test framework this way from an org-mode source block.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">import</span> unittest
<span style="color: #BA36A5;">TOLERANCE</span> = 1e-5

<span style="color: #BA36A5;">s</span> = <span style="color: #008000;">'''from scipy.optimize import fsolve</span>
<span style="color: #008000;">import numpy as np</span>

<span style="color: #008000;">def objective(x):</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">   return np.exp(x) - 3</span>

<span style="color: #008000;">def solve():</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">   return fsolve(objective, 3)[0]</span>

<span style="color: #008000;">print solve()'''</span>

<span style="color: #0000FF;">def</span> <span style="color: #006699;">test_solve</span>(s):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">exec</span> s <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">globals</span>()
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">if</span> (<span style="color: #006FE0;">abs</span>(np.log(3) - solve()) &lt;= TOLERANCE):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(<span style="color: #008000;">'Correct'</span>)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">else</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(<span style="color: #008000;">'incorrect'</span>)

test_solve(s)
</pre>
</div>

<pre class="example">
1.09861228867
Correct
</pre>

<p>
Next, we need to think about how we could generate an import statement from a code block name, import in python, and run a test function. We can assume that the test code will be in a file called "test_%s.py" on your python path. Here are the contents of test_solve.py.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">import</span> numpy <span style="color: #0000FF;">as</span> np
<span style="color: #BA36A5;">TOLERANCE</span> = 1e-5

<span style="color: #0000FF;">def</span> <span style="color: #006699;">solve_solution</span>():
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">from</span> scipy. optimize <span style="color: #0000FF;">import</span> fsolve
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">import</span> numpy <span style="color: #0000FF;">as</span> np

<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">def</span> <span style="color: #006699;">objective</span>(x):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> np.exp(x) - 3

<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> fsolve(objective, 3)[0]


<span style="color: #0000FF;">def</span> <span style="color: #006699;">test_solve</span>(s):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">exec</span> s <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">globals</span>()
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">if</span> (<span style="color: #006FE0;">abs</span>(solve_solution() - solve()) &lt;= TOLERANCE):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(<span style="color: #008000;">'Correct!'</span>)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">else</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(<span style="color: #008000;">'Incorrect'</span>)
</pre>
</div>

<p>
Now, we can import that, and use the functions. Here is the Python script we need to run to test it.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">import</span> test_solve
test_solve.test_solve(<span style="color: #036A07;">'''</span>
<span style="color: #036A07;">from scipy. optimize import fsolve</span>
<span style="color: #036A07;">import numpy as np</span>

<span style="color: #036A07;">def objective(x):</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #036A07;">   return np.exp(x) - 3</span>

<span style="color: #036A07;">def solve():</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #036A07;">   return fsolve(objective, 3)[0]</span>

<span style="color: #036A07;">print solve()'''</span>)
</pre>
</div>

<pre class="example">
1.09861228867
Correct!
</pre>

<p>
Now, an elisp block to do that. One way to do this is to just run a shell command passing the string to a python interpreter. This is a short way away from an Emacs command now.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">let*</span> ((string <span style="color: #008000;">"import test_solve</span>
<span style="color: #008000;">test_solve.test_solve('''</span>
<span style="color: #008000;">from scipy. optimize import fsolve</span>
<span style="color: #008000;">import numpy as np</span>

<span style="color: #008000;">def objective(x):</span>
<span style="color: #008000;">    return np.exp(x) - 3</span>

<span style="color: #008000;">def solve():</span>
<span style="color: #008000;">    return fsolve(objective, 3)[0]</span>

<span style="color: #008000;">print solve()''')"</span>))
  (shell-command-to-string (format <span style="color: #008000;">"python -c \"%s\""</span> string)))
</pre>
</div>

<pre class="example">
1.09861228867
Correct!
</pre>

<p>
Ok, now to wrap it all up in a function we can run from Emacs in a code block to test it. With the cursor in a code block, we get the name, and build the python code, and run it. The function is more complex than I anticipated because I end up  running the code block essentially twice, once to get a results block and once to get the test results. For short problems this is not an issue. I also add the test results in a way that is compatible with the current results.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">check</span> ()
  (<span style="color: #0000FF;">interactive</span>)
  (<span style="color: #0000FF;">let*</span> ((src-block (org-element-context))
         (name (org-element-property <span style="color: #006FE0;">:name</span> src-block))
         (code (org-element-property <span style="color: #006FE0;">:value</span> src-block))
         (end (org-element-property <span style="color: #006FE0;">:end</span> src-block))
         (results)
         (template (format <span style="color: #008000;">"import test_%s</span>
<span style="color: #008000;">test_%s.test_%s('''%s''')"</span> name name name code))
         (output (format
                  <span style="color: #008000;">"\n%s\n"</span>
                  (s-join
                   <span style="color: #008000;">"\n"</span>
                   (mapcar
                    (<span style="color: #0000FF;">lambda</span> (s)
                      (<span style="color: #0000FF;">if</span> (s-starts-with? <span style="color: #008000;">":"</span> s)
                          s
                        (concat <span style="color: #008000;">": "</span> s)))
                    (s-split
                     <span style="color: #008000;">"\n"</span>
                     (shell-command-to-string
                      (format <span style="color: #008000;">"python -c \"%s\""</span> template))))))))
    <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">execute block as normal</span>
    (org-babel-execute-src-block)
    <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">and add some output to the Results block</span>
    (<span style="color: #0000FF;">if</span> (org-babel-where-is-src-block-result)
        (<span style="color: #0000FF;">progn</span>
          (goto-char (org-babel-where-is-src-block-result))
          (<span style="color: #0000FF;">setq</span> results (org-element-context))
          <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">delete results line</span>
          (kill-line)
          <span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">delete the results</span>
          (<span style="color: #0000FF;">setf</span> (buffer-substring (org-element-property <span style="color: #006FE0;">:begin</span> results)
                                  (org-element-property <span style="color: #006FE0;">:post-affiliated</span> results))
                <span style="color: #008000;">""</span>)
          <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">paste results line back</span>
          (yank)
          <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">and the output from your code</span>
          (insert output))
      (message <span style="color: #008000;">"%s"</span> output))))
</pre>
</div>

<pre class="example">
check
</pre>

<p>
Now, we use a named src-block so we can call M-x check in it, and check the answer.
</p>

<div class="org-src-container">

<pre class="src src-python" id="solve"><span style="color: #0000FF;">from</span> scipy.optimize <span style="color: #0000FF;">import</span> fsolve
<span style="color: #0000FF;">import</span> numpy <span style="color: #0000FF;">as</span> np

<span style="color: #0000FF;">def</span> <span style="color: #006699;">objective</span>(x):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> np.exp(x) - 3

<span style="color: #0000FF;">def</span> <span style="color: #006699;">solve</span>():
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> fsolve(objective, 3)

<span style="color: #0000FF;">print</span> solve()
</pre>
</div>

<pre class="example">
[ 1.09861229]
Correct!
</pre>

<p>
I would like to be able to provide a solution function that would show a user my solution they were tested against. Python provides the <code>inspect</code> module that can do this. Here is how we get the code in Python.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">import</span> inspect
<span style="color: #0000FF;">import</span> test_solve

<span style="color: #0000FF;">print</span> inspect.getsource(test_solve.solve_solution)
</pre>
</div>

<pre class="example">
def solve_solution():
    from scipy. optimize import fsolve
    import numpy as np

    def objective(x):
        return np.exp(x) - 3

    return fsolve(objective, 3)[0]
</pre>

<p>
This makes it easy to wrap up a function in emacs that will show this from at src block. We just get the block name, and build the python code and execute it here.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">show-solution</span> ()
  (<span style="color: #0000FF;">interactive</span>)
  (<span style="color: #0000FF;">let*</span> ((src-block (org-element-context))
         (name (org-element-property <span style="color: #006FE0;">:name</span> src-block))
         (template (format  <span style="color: #008000;">"import inspect</span>
<span style="color: #008000;">import test_%s</span>

<span style="color: #008000;">print inspect.getsource(test_%s.%s_solution)"</span> name name name)))
    (switch-to-buffer-other-window (get-buffer-create <span style="color: #008000;">"solution"</span>))
    (erase-buffer)
    (insert (shell-command-to-string
             (format <span style="color: #008000;">"python -c \"%s\""</span> template)))
    (python-mode)))
</pre>
</div>

<pre class="example">
show-solution
</pre>

<p>
That summarizes the main features. It allows me to write a test module that has some name conventions to define a solution function, and a test function. Emacs can generate some boilerplate code for different problem names, and run the test to give the user some feedback. Most of the code in this post would not be directly visible to a user, it would be buried in a python module somewhere on the path, and in elisp files providing the glue. I am not sure how much obfuscation you can put in the python files, e.g. just providing byte-compiled code, so it is less easy to just read it. That is not as big a deal when it is just a study guide/feedback system.
</p>

<p>
From an authoring point of view, this seems pretty good to me. It is feasible I think to write an org-source document like this with tangling for the test modules, and an export to org that does not have the solutions in it. The only subtle point might be needing to alter Python paths to find the test modules if they aren't installed via something like pip.
</p>


<p>
I think this is pretty flexible, and could handle problems that take arguments, e.g. write a function that sorts a list. Here is a simple example of that. First we write the test_sort.py file with a solution, and some tests.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">def</span> <span style="color: #006699;">sort_solution</span>(LIST):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> LIST.sort()

<span style="color: #0000FF;">def</span> <span style="color: #006699;">test_sort</span>(s):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">exec</span> s <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">globals</span>()
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">if</span> sort([3, 4, 2]) == [2, 3, 4]:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(<span style="color: #008000;">'passed test 1'</span>)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">if</span> sort([<span style="color: #008000;">'z'</span>, <span style="color: #008000;">'b'</span>]) == [<span style="color: #008000;">'b'</span>, <span style="color: #008000;">'z'</span>]:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(<span style="color: #008000;">'passed test 2'</span>)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-python" id="sort"><span style="color: #0000FF;">def</span> <span style="color: #006699;">sort</span>(LIST):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">s</span> = <span style="color: #006FE0;">sorted</span>(LIST)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> s
</pre>
</div>
<pre class="example">
passed test 1
passed test 2
</pre>

<p>
Maybe it would make sense to use unittests, or nose or some other testing framework if it makes writing the tests easier. Another day.
</p>
<p>Copyright (C) 2015 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2015/10/03/A-framework-for-automated-feedback-with-Python-and-org-mode.org">org-mode source</a><p><p>Org-mode version = 8.2.10</p>